/*
    排版相关标签

      1.标题标签：h1~h6  越大越小
      2.段落标签：<p></p>
      3.直线标签：<hr /> 一条直线
      4.换行标签：<br />
*/

/*
    盒子相关标签

      1.div：块级元素
      2.span：行内元素
*/

/*
    文本格式化标签

      1.文字以粗体方式显示：<b></b> <strong></strong>
      2.文字以粗体方式显示：<i></i> <em></em>
      2.文字以加删除线方式显示：<s></s> <del></del>
      2.文字以加下划线方式显示：<u></u> <ins></ins>

      注意：b、i、s、u只有使用样式的意思，strong、em、del、ins有强调的意思
*/

/*
    图像标签

      <img src="url" alt="文本" title="文本" width="像素" height="像素" border="数字"/>单标签

      1.src：图片的路径地址
      2.alt：图片损坏时的替代文本
      3.title：鼠标悬停在图片的区域，显示提示文本
      4.width：图像宽度
      5.height：图像高度
      6.border：设置图像的边框宽度
*/

/*
    链接标签

      <a href="url" target="目标窗口弹出方式"></a>

      1.外部链接，url="http://www.baidu.com"
      2.内部链接，url="内部文件路径"
      3.如果还没有确定链接的地址，url="#",表示空链接
      4.网页中的各种元素都可以添加超链接
      5.目标窗口弹出方式：target="_self"自身窗口改变，target="_blank"在新窗口中打开。


    锚点定位
      a标签中的href值为要跳转的元素的id值
*/

/*
    base标签

      作用：为页面上的所有链接规定默认地址或默认目标。包含target属性和href属性
      位置：标签写在head中
*/

/*
    特殊字符标签
        1.  空格：&nbsp;
        2.< 小于号：&lt;
        3.& 和号：&gt;
        4.￥ 人民币：&yen;
        5.© 版权：&copy;
        6.® 注册商标：&reg;
        7.℃ 摄氏度：&deg;
        8.± 正负号：&plusmn
        9.× 乘号：&times
        10.÷ 除号：&divide
        11.平方2：&sup2
        12.平方3：&sup3
*/

/*
    html的注释标签
        多行注释：<!-- 里面是注释的内容 -->
*/

/*
    路径问题
      一、相对路径
            返回上一级目录../
      二、绝对路径
            绝对路径地址  C:\Users\Administrator\Desktop\Note\note\html+css
*/

/*
    列表标签

      1.无序列表
        <ul>
          <li>无序列表</li>
          <li>无序列表</li>
        </ul>
      2.有序列表
        <ol>
          <li>有序列表</li>
          <li>有序列表</li>
        </ol>
      3.自定义列表
        <dl>
          <dd>浙江</dd>
          <dt>杭州</dt>
          <dt>宁波</dt>
          <dt>温州</dt>
        </dl>
*/

/*
  表格标签
*/